class RussianButtons:
    buttons = {
        "start": "Начать",
        "analyze_food": "📸 Анализировать еду",
        "help": "Помощь",
        "profile": "Профиль",
        "reports": "Отчеты",
        "buy_premium": "Купить премиум",
        "nutrition": "Калорийность",
        "recipe": "Рецепт",
        "new_photo": "Новое фото",
        "back": "Главная",
        "set_calorie_goal": "Установить цель по калориям",
        "calorie_plan": "План калорий",
        "buy_month_confirm": "Купить премиум на месяц",
        "buy_week_confirm": "Купить премиум на неделю",
        "enter_promo": "Ввести промокод",
        "report_day": "Отчет за день",
        "report_week": "Отчет за неделю",
        "report_month": "Отчет за месяц",
        "admin_statistics": "Статистика",
        "admin_manage_limits": "Управление лимитами",
        "admin_exit": "Выйти",
        "admin_sub_toggle_premium": "Установить режим премиум",
        "admin_sub_toggle_free": "Установить режим бесплатный",
        "admin_reset_own_limits": "Сбросить лимиты себе",
        "admin_reset_limits": "Сбросить лимиты пользователю",
        "admin_promo": "Промокод",
        "stat_week": "За неделю",
        "stat_month": "За месяц",
        "stat_all_time": "За все время",
    }

    @classmethod
    def get(cls, key: str) -> str:
        return cls.buttons.get(key, f"Кнопка:{key}")
