# app/locales/ru/buttons.py

class RussianButtons:
    """Кнопки русского интерфейса"""

    buttons = {
        # Стартовая страница
        "start": "Начать",

        # Главная
        "analyze_food": "📸 Анализировать еду",
        "help": "Помощь",
        "profile": "Профиль",
        "reports": "Отчеты",
        "buy_premium": "Купить премиум",

        # Раздел анализа
        "nutrition": "Калорийность",
        "recipe": "Рецепт",
        "new_photo": "Новое фото",
        "back": "Главная",

        # Под меню анализа
        "ate_this": "Я это съел",
        "did_not_eat": "Я это не ел",

        # Под меню лимитов
        "buy_premium": "Купить премиум",

        # Под меню преимуществ премиум
        "buy_premium": "Купить премиум",

        # Помощь
        "set_calorie_goal": "Установить цель по калориям",

        # Профиль
        "calorie_plan": "План калорий",

        # Оплата
        "buy_month_confirm": "Купить премиум на месяц",
        "buy_week_confirm": "Купить премиум на неделю",
        "enter_promo": "Ввести промокод",

        # Отчеты
        "report_day": "Отчет за день",
        "report_week": "Отчет за неделю",
        "report_month": "Отчет за месяц",

        # Админка
        "admin_statistics": "Статистика",
        "admin_manage_limits": "Управление лимитами",
        "admin_exit": "Выйти",

        # Управление лимитами
        "admin_sub_toggle_premium": "Установить режим премиум",
        "admin_sub_toggle_free": "Установить режим бесплатный",
        "admin_reset_own_limits": "Сбросить лимиты себе",
        "admin_reset_limits": "Сбросить лимиты пользователю",
        "admin_promo": "Промокод",

        # Статистика
        "stat_week": "За неделю",
        "stat_month": "За месяц",
        "stat_all_time": "За все время",
    }

    @classmethod
    def get(cls, key: str) -> str:
        return cls.buttons.get(key, f"Кнопка:{key}")
