# app/locales/ru/buttons.py

class RussianButtons:
    """Кнопки русского интерфейса"""

    buttons = {
        # Стартовая страница
        "start": "🚀 Начать",

        # Главная
        "analyze_food": "📸 Анализировать еду",
        "help": "❓ Помощь",
        "profile": "👤 Профиль",
        "reports": "📊 Отчёты",
        "buy_premium": "💎 Купить премиум",

        # Раздел анализа
        "nutrition": "🔥 Калорийность",
        "recipe": "📖 Рецепт",
        "new_photo": "🖼 Новое фото",
        "back": "🏠 Главная",

        # Под меню анализа (на будущее)
        "ate_this": "✅ Я это съел",
        "did_not_eat": "🚫 Я это не ел",

        # Помощь
        "set_calorie_goal": "🎯 Установить цель по калориям",

        # Профиль
        "calorie_plan": "📈 План калорий",

        # Оплата
        "buy_month_confirm": "💎 Купить премиум на месяц",
        "buy_week_confirm": "⭐ Купить премиум на неделю",
        "enter_promo": "🎟 Ввести промокод",

        # Отчеты
        "report_day": "📅 Отчёт за день",
        "report_week": "🗓 Отчёт за неделю",
        "report_month": "📆 Отчёт за месяц",

        # Админка
        "admin_statistics": "📊 Статистика",
        "admin_manage_limits": "⚙️ Управление лимитами",
        "admin_exit": "🚪 Выйти",
        "admin_limits_reset_me": "🔁 Сбросить мои лимиты",
        "admin_premium_on_me": "⭐ Включить мой премиум",
        "admin_premium_off_me": "🚫 Выключить мой премиум",
        "admin_limits_reset_other": "👤 Сброс лимитов по telegram_id",
        "admin_limits_back": "⬅️ Назад",

        # Управление лимитами
        "admin_sub_toggle_premium": "💎 Установить режим премиум",
        "admin_sub_toggle_free": "🆓 Установить режим бесплатный",
        "admin_reset_own_limits": "♻️ Сбросить лимиты себе",
        "admin_reset_limits": "♻️ Сбросить лимиты пользователю",
        "admin_promo": "🎟 Промокод",

        # Статистика
        "stat_week": "🗓 За неделю",
        "stat_month": "📆 За месяц",
        "stat_all_time": "🌍 За всё время",

       
    }

    @classmethod
    def get(cls, key: str) -> str:
        return cls.buttons.get(key, f"Кнопка:{key}")
